public interface RegenerationRule {
    /*
    Вариант№1
    добавить интерфейс с добвавлением удаления и регенерации голов
    1. Добавить Метод "удаление головы"
    2. Добавить диапазон сколько голов появиться вместо удаленной
    3. Реализовать интерфейсный метод
    4. Добавить вывод на экран результата

    Вариант №2
    1. Добавить Метод "удаление головы"  в класс FBhead
    2. Добавить диапозон сколько голов появиться вместо удаленной
    3. Добавить вывод на экран результата
    */
    void removedHead(int heads);


}

